Autodesk.Revit.DB.ElementOnPhaseStatus
The statuses that an element can have with respect to a given phase.
Since:
2012

Autodesk.Revit.DB.ElementOnPhaseStatus.Future
Created after this phase

Autodesk.Revit.DB.ElementOnPhaseStatus.Temporary
Created and demolished during this phase

Autodesk.Revit.DB.ElementOnPhaseStatus.New
Created on this phase (and not demolished)

Autodesk.Revit.DB.ElementOnPhaseStatus.Demolished
Created before the given phase, to be demolished on the given phase

Autodesk.Revit.DB.ElementOnPhaseStatus.Existing
Created in a previous phase, existing through the end of the given phase

Autodesk.Revit.DB.ElementOnPhaseStatus.Past
Created and demolished before the given phase

Autodesk.Revit.DB.ElementOnPhaseStatus.None
Phase status is undefined (e.g., for annotations)